# 21. Напишите программу, которая определит позицию второго вхождения строки
# в списке либо сообщит, что её нет.

# *Пример:*

# - список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# - список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# - список: [], ищем: "123", ответ: -1

list = ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"]
list_find = "фых"
s = 0
index = 0
for i in list:
    if i == list_find:
        s += 1
        if s == 2:
            print ("есть!, позиция = ", index)
    index += 1
if s != 2:
    print("-1")