# Задание: Создать телефонный справочник с возможностью импорта и экспорта данных.
# Модуль контроллер
# Модуль для импорта (ввода данных)
# Модуль для экспорта (вывод данных)
# Строка содержит:
#   id, имя, фамилию, номер телефона, комментарий
#        * символ разделитель на выбор (можно использовать пробел или запятые)
#          + файл с хранением этих строк
#  * Добавить сортировку по имени или по id
#  * Добавить вывод только имени и фамилии

import controller as clr

print ("запуск Main")
clr.controller()