# 20. Задайте список. Напишите программу, которая определит, присутствует
# ли в заданном списке строк некое число (и индекс)

list = ["1","2","два","три","55","6","37","8.20","45"]
n = int(input("Введите число n: "))
len = int(len(list))
check = 0
for i in range(n):
    a = list[i]
    if a.isdigit():
        if n == int(a):
            print("есть!, на позиции", i)
            check = 1
if check == 0:
    print("искомого элемента нет")