file_name_student_ID = 'Student_ID.txt'
file_name_lesson = 'Lesson_ID.txt'
name_list = ["Иван", "Сергей", "Дмитрий", "Евгений", "Владимир", "Макс", "Артем", "Филипп", "Юрий", "Федор", "Борис", "Равиль", "Алексей", "Александр"]
fam_list = ["Иванов", "Петров", "Сидоров", "Сергеев", "Малинин", "Макеев", "Артинский", "Гламель", "Дрозд", "Штиль", "Фадеев", "Гуриев", "Воробъев", "Мансуров"]
lesson_list = ["Физика", "Химия", "Математика", "Литература", "География", "Физкультура", "История", "Информатика", "Биология"]

# data_student - список стундентов / 0 - ID студента / 1 - имя / 2 - фамилия
# data_lesson - список стундентов / 0 - ID студента / 1 - предмет / 2 - список оценок